# M贸dulo#3 (**Transformaci贸n de datos**) - By Monica

In [1]:
# importamos las librer铆as que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np
import re

# Imputaci贸n de nulos usando m茅todos avanzados estad铆sticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Librer铆as de visualizaci贸n
# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt

# Evaluar linealidad de las relaciones entre las variables
# y la distribuci贸n de las variables
# -----------------------------------------------------------------------------
from scipy.stats import chi2_contingency, ttest_ind, shapiro, kstest, poisson, chisquare, expon

# Configuraci贸n
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames

# Gesti贸n de los warnings
# -----------------------------------------------------------------------
import warnings
warnings.filterwarnings("ignore")

## `Fase 1 --> Exploraci贸n y Limpieza`

>  En esta fase, hago una exploraci贸n de los datos, (reviso el tipo de dato, que valores tiene cada columna y que significa para el cliente y para el an谩lisis). Por otro lado, espero saber el total de registros reales, para esto se quitan todos los duplicados y se trabaja con los valores finales para empezar hacer una limpieza, seg煤n criterios de an谩lisis.

## -->Exploraci贸n de la Data

#### DATA --> Customer-Flight-Activity

In [2]:
df_fly = pd.read_csv('Customer-Flight-Activity.csv')
df_fly.sample(5)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
228240,791852,2018,2,8,0,8,1176,126.36,0,0
123020,351937,2017,8,0,0,0,0,0.00,0,0
394744,979330,2018,11,0,0,0,0,0.00,0,0
3649,108857,2017,12,0,0,0,0,0.00,0,0
355578,135382,2018,10,6,0,6,666,66.00,0,0

| `Nombre columna English`         | `En Espa帽ol`                        |
|--------------------------------|-----------------------------------|
| Loyalty Number                 | N煤mero de fidelizaci贸n            |
| Year                           | A帽o                               |
| Month                          | Mes                               |
| Flights Booked                 | Vuelos Reservados                 |
| Flights with Companions        | Vuelos con acompa帽antes           |
| Total Flights                  | Total de vuelos                   |
| Distance                       | Distanciarse                      |
| Points Accumulated             | Puntos acumulados                 |
| Points Redeemed                | Puntos canjeados                  |
| Dollar Cost Points Redeemed    | Puntos de costo en d贸lares canjeados |

In [3]:

# EXPLORAR LOS DATAFRAME EN GENERAL 

def exploracion_datos(df):
    print('Filas y Columnas del DATAFRAME \n')
    print(f"El n煤mero de filas que tenemos es de {df.shape[0]}.\nEl n煤mero de columnas es de {df.shape[1]}\n")
    print('____________________________________________________________\n')
    
    print(' Nombre de todas las Columnas del DATAFRAME: \n')
    print(df.columns)
    print('____________________________________________________________\n')
    
    print('INFORMACIN GENERAL DEL DATAFRAME \n')
    print(df.info())
    print('____________________________________________________________\n')
    
    print('Ver los NULOS del DataFrame \n')
    print(f'Nulos de todo el data: --> {df.isnull().sum().mean() * 100} \n')
    for columna in df.columns:
        cantidad_valores_nulos = df[columna].isnull().mean() * 100
        print(f'La columna {columna}: {cantidad_valores_nulos}')
    print('____________________________________________________________\n')
    
    print('Valores NICOS por columna:\n')
    for columna in df.columns:
        cantidad_valores_unicos = df[columna].unique()
        print(f'La columna {columna}: {len(cantidad_valores_unicos)}')
        print(f'La columna {columna}: {cantidad_valores_unicos}')
        
    print('____________________________________________________________\n')
    
    print('Valores DUPLICADOS por columna es de:\n')
    for columna in df.columns:
        cantidad_duplicados = df[columna].duplicated().sum()
        print(f'La columna {columna}: {cantidad_duplicados}')
    print('____________________________________________________________\n')
  
    print('--> RESUMEN ESTADSTICO \n')
    print('<<< Variables Num茅ricas >>> \n')
    print(df.describe().T)

In [4]:
exploracion_datos(df_fly)

Filas y Columnas del DATAFRAME

El n煤mero de filas que tenemos es de 405624.
El n煤mero de columnas es de 10

____________________________________________________________

 Nombre de todas las Columnas del DATAFRAME:

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')
____________________________________________________________

INFORMACIN GENERAL DEL DATAFRAME

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 10 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               405624 non-null  int64
 1   Year                         405624 non-null  int64
 2   Month                        405624 non-null  int64
 3   Flights Booked               405624 non-null  int64
 4   Flights with Companions      405624 non-null  int64
 5   Total Flights                405624 non-null  int64
 6   Distance                     405624 non-null  int64
 7   Points Accumulated           405624 non-null  float64
 8   Points Redeemed              405624 non-null  int64
 9   Dollar Cost Points Redeemed  405624 non-null  int64
dtypes: float64(1), int64(9)
memory usage: 30.9 MB
None
____________________________________________________________

Ver los NULOS del DataFrame

Nulos de todo el data: --> 0.0

La columna Loyalty Number: 0.0
La columna Year: 0.0
La columna Month: 0.0
La columna Flights Booked: 0.0
La columna Flights with Companions: 0.0
La columna Total Flights: 0.0
La columna Distance: 0.0
La columna Points Accumulated: 0.0
La columna Points Redeemed: 0.0
La columna Dollar Cost Points Redeemed: 0.0
____________________________________________________________

Valores NICOS por columna:

La columna Loyalty Number: 16737
La columna Loyalty Number: [100018 100102 100140 ... 999731 999788 999891]
La columna Year: 2
La columna Year: [2017 2018]
La columna Month: 12
La columna Month: [ 1  9  2  3 11  4  5  7  6  8 10 12]
La columna Flights Booked: 22
La columna Flights Booked: [ 3 10  6  0  8 11  9  4  7  5  2  1 12 13 14 16 15 17 18 19 20 21]
La columna Flights with Companions: 12
La columna Flights with Companions: [ 0  4  7  1  6  3  5  2 10  8  9 11]
La columna Total Flights: 33
La columna Total Flights: [ 3 14  6  0 15 11 12 10  8  9  7  5 16  2  1 17 13 22  4 19 18 21 26 20
 23 25 27 24 28 30 29 31 32]
La columna Distance: 4746
La columna Distance: [1521 2030 1200 ... 1217  617 4135]
La columna Points Accumulated: 1549
La columna Points Accumulated: [152.   203.   120.   ...  18.75 601.   626.  ]
La columna Points Redeemed: 587
La columna Points Redeemed: [  0 341 364 310 445 312 343 366 389 292 447 324 456 409 436 327 322 291
 323 300 290 309 325 386 321 363 340 670 443 517 444 328 344 367 313 333
 293 449 297 455 372 356 405 381 466 419 369 352 482 335 329 305 415 396
 317 348 314 334 350 330 318 298 420 336 471 680 441 353 484 301 374 417
 501 299 398 307 368 306 347 439 395 481 337 382 426 373 399 424 326 392
 438 467 480 448 308 400 376 375 460 339 385 611 431 320 362 404 442 410
 361 319 435 414 464 477 315 485 370 421 349 371 416 496 510 667 465 434
 346 487 408 500 360 378 345 358 479 380 411 491 505 446 425 476 393 418
 332 401 454 303 594 506 355 302 403 379 437 561 483 597 391 562 342 407
 490 468 488 457 365 357 463 388 413 351 462 440 493 507 338 377 428 525
 390 473 359 423 519 453 522 429 450 383 469 402 354 422 458 384 656 461
 427 478 523 719 538 515 394 472 433 387 540 530 498 512 452 311 470 541
 331 570 527 658 494 638 486 509 316 492 536 502 551 504 304 296 294 495
 432 526 459 589 529 586 537 503 552 779 516 639 474 547 542 557 406 563
 511 518 532 553 508 560 676 716 593 513 499 566 497 546 451 533 489 708
 531 567 521 412 430 610 528 556 582 720 397 578 772 571 534 539 576 585
 520 601 598 630 524 588 550 514 573 544 669 577 580 591 614 574 579 595
 618 776 548 602 543 581 572 607 603 564 620 615 636 575 584 559 648 590
 545 627 608 568 625 637 632 650 600 613 621 535 587 475 592 624 619 554
 583 628 558 664 789 635 617 699 604 646 659 616 704 569 626 609 751 599
 644 800 677 666 596 612 629 657 675 702 683 633 811 688 565 706 605 549
 662 660 295 673 555 631 715 651 697 792 678 655 707 668 687 622 642 781
 695 711 701 721 623 693 692 640 665 684 745 808 746 749 694 643 725 850
 703 726 691 740 737 689 765 649 690 661 696 682 700 750 771 798 710 736
 757 743 654 758 647 606 718 739 814 761 783 679 766 777 799 723 653 730
 681 760 793 742 685 734 839 782 735 756 795 728 780 802 815 851 820 770
 705 738 645 686 755 754 778 671 634 762 784 717 797 744 672 768 790 741
 824 748 674 825 794 845 827 801 714 731 724 876 747 663 709 823 791 804
 832 698 727 833 810 864 753 840 722 641 822 834 844 865 869 733 828 773
 713 821 849 767 759 729 803 838 775 818 843 830 847 872 809 786 812 785
 841 752 712 816 289 652 787 852 848 769 846 870 871 796 807 774 805 763
 806 836 837 857 813 873 732 826 858 817 829 819 866 842 861 855 831 875
 868 835 764 862 874 860 863 854 788 867 859]
La columna Dollar Cost Points Redeemed: 49
La columna Dollar Cost Points Redeemed: [ 0 28 30 25 36 32 24 26 37 33 35 27 31 54 42 29 38 34 39 55 41 49 40 48
 45 53 58 44 43 46 52 47 63 57 62 51 50 64 56 61 65 60 68 59 66 69 67 71
 70]
____________________________________________________________

Valores DUPLICADOS por columna es de:

La columna Loyalty Number: 388887
La columna Year: 405622
La columna Month: 405612
La columna Flights Booked: 405602
La columna Flights with Companions: 405612
La columna Total Flights: 405591
La columna Distance: 400878
La columna Points Accumulated: 404075
La columna Points Redeemed: 405037
La columna Dollar Cost Points Redeemed: 405575
____________________________________________________________

--> RESUMEN ESTADSTICO

<<< Variables Num茅ricas >>>

                                count           mean            std       min  \
Loyalty Number               405624.0  550037.873084  258935.286969  100018.0
Year                         405624.0    2017.500000       0.500001    2017.0
Month                        405624.0       6.500000       3.452057       1.0
Flights Booked               405624.0       4.115052       5.225518       0.0
Flights with Companions      405624.0       1.031805       2.076869       0.0
Total Flights                405624.0       5.146858       6.521227       0.0
Distance                     405624.0    1208.880059    1433.155320       0.0
Points Accumulated           405624.0     123.692721     146.599831       0.0
Points Redeemed              405624.0      30.696872     125.486049       0.0
Dollar Cost Points Redeemed  405624.0       2.484503      10.150038       0.0

                                   25%       50%        75%       max
Loyalty Number               326961.00  550834.0  772194.00  999986.0
Year                           2017.00    2017.5    2018.00    2018.0
Month                             3.75       6.5       9.25      12.0
Flights Booked                    0.00       1.0       8.00      21.0
Flights with Companions           0.00       0.0       1.00      11.0
Total Flights                     0.00       1.0      10.00      32.0
Distance                          0.00     488.0    2336.00    6293.0
Points Accumulated                0.00      50.0     239.00     676.5
Points Redeemed                   0.00       0.0       0.00     876.0
Dollar Cost Points Redeemed       0.00       0.0       0.00      71.0

In [5]:
df_fly['Loyalty Number'].duplicated().sum()

388887

In [6]:
df_fly['Loyalty Number'].value_counts()

Loyalty Number
678205    72
989528    48
373638    48
684889    48
684881    48
          ..
428526    24
428536    24
428565    24
428590    24
999891    24
Name: count, Length: 16737, dtype: int64

In [7]:
# Identificar filas duplicadas exactas (todas las columnas iguales)
exact_duplicates = df_fly[df_fly.duplicated(keep=False)]

# Filtrar los duplicados que tambi茅n tienen el mismo 'Loyalty Number'
exact_duplicates_sorted = exact_duplicates.sort_values(by=['Loyalty Number', 'Year', 'Month'])

# Mostrar el DataFrame resultante
exact_duplicates_sorted

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
42,101902,2017,1,0,0,0,0,0.0,0,0
16942,101902,2017,2,0,0,0,0,0.0,0,0
16943,101902,2017,2,0,0,0,0,0.0,0,0
33843,101902,2017,3,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
151972,992168,2017,9,0,0,0,0,0.0,0,0
304080,992168,2018,6,0,0,0,0,0.0,0,0
304081,992168,2018,6,0,0,0,0,0.0,0,0
354783,992168,2018,9,0,0,0,0,0.0,0,0
354784,992168,2018,9,0,0,0,0,0.0,0,0

In [8]:
len(exact_duplicates_sorted['Loyalty Number'].unique())

159

In [9]:
valor = exact_duplicates_sorted.loc[exact_duplicates_sorted['Loyalty Number'] == 101902 ]
valor_sorted = valor.sort_values(by=['Loyalty Number', 'Year', 'Month'])
valor_sorted

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
42,101902,2017,1,0,0,0,0,0.0,0,0
16942,101902,2017,2,0,0,0,0,0.0,0,0
16943,101902,2017,2,0,0,0,0,0.0,0,0
33843,101902,2017,3,0,0,0,0,0.0,0,0
33844,101902,2017,3,0,0,0,0,0.0,0,0
101447,101902,2017,7,0,0,0,0,0.0,0,0
101448,101902,2017,7,0,0,0,0,0.0,0,0
185952,101902,2017,12,0,0,0,0,0.0,0,0
185953,101902,2017,12,0,0,0,0,0.0,0,0

In [10]:
# Eliminar duplicados exactos (todas las columnas iguales) y conservar solo la primera ocurrencia
df_unique = exact_duplicates_sorted.drop_duplicates(keep='first')

# Mostrar el DataFrame resultante
df_unique

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
41,101902,2017,1,0,0,0,0,0.0,0,0
16942,101902,2017,2,0,0,0,0,0.0,0,0
33843,101902,2017,3,0,0,0,0,0.0,0,0
101447,101902,2017,7,0,0,0,0,0.0,0,0
185952,101902,2017,12,0,0,0,0,0.0,0,0
...,...,...,...,...,...,...,...,...,...,...
33664,992168,2017,2,0,0,0,0,0.0,0,0
101268,992168,2017,6,0,0,0,0,0.0,0,0
151971,992168,2017,9,0,0,0,0,0.0,0,0
304080,992168,2018,6,0,0,0,0,0.0,0,0
354783,992168,2018,9,0,0,0,0,0.0,0,0

#### DATA --> Customer-Loyalty-History

In [11]:
df_loyal = pd.read_csv('Customer-Loyalty-History.csv')
df_loyal.sample(5)

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
16608,414211,Canada,Ontario,Ottawa,K1F 2R2,Female,Bachelor,57841.0,Married,Star,28622.31,Standard,2014,1,NaN,NaN
10409,334454,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Married,Star,2419.31,Standard,2016,8,NaN,NaN
12215,235930,Canada,Saskatchewan,Regina,S6J 3G0,Male,Bachelor,86728.0,Single,Star,3360.44,Standard,2013,12,NaN,NaN
3805,133128,Canada,British Columbia,Victoria,V10 6T5,Male,Bachelor,33784.0,Married,Star,2588.86,2018 Promotion,2018,2,NaN,NaN
13140,557289,Canada,Ontario,Kingston,M9K 2P4,Male,Bachelor,85067.0,Married,Star,4871.15,Standard,2017,3,NaN,NaN

| `English`             | `Espa帽ol`                |
|---------------------|-------------------------|
| Loyalty Number      | N煤mero de lealtad       |
| Country             | Pa铆s                    |
| Province            | Provincia               |
| City                | Ciudad                  |
| Postal Code         | C贸digo Postal           |
| Gender              | G茅nero                  |
| Education           | Educaci贸n               |
| Salary              | Salario                 |
| Marital Status      | Estado Civil            |
| Loyalty Card        | Tarjeta de Lealtad      |
| CLV                 | Valor del Cliente (CLV) |
| Enrollment Type     | Tipo de Inscripci贸n     |
| Enrollment Year     | A帽o de Inscripci贸n      |
| Enrollment Month    | Mes de Inscripci贸n      |
| Cancellation Year   | A帽o de Cancelaci贸n      |
| Cancellation Month  | Mes de Cancelaci贸n      |

In [13]:

# EXPLORAR LOS DATAFRAME EN GENERAL 

def exploracion_datos1(df):
    print(' Filas y Columnas del DATAFRAME \n')
    print(f"El n煤mero de filas que tenemos es de {df.shape[0]}.\nEl n煤mero de columnas es de {df.shape[1]}\n")
    print('____________________________________________________________\n')
    
    print(' Nombre de todas las Columnas del DATAFRAME: \n')
    print(df.columns)
    print('____________________________________________________________\n')
    
    print('INFORMACIN GENERAL DEL DATAFRAME \n')
    print(df.info())
    print('____________________________________________________________\n')
    
    print('Ver los NULOS del DataFrame \n')
    print(f'Nulos de todo el data: --> {df.isnull().sum().mean() * 100} \n')
    for columna in df.columns:
        cantidad_valores_nulos = df[columna].isnull().mean() * 100
        print(f'La columna {columna}: {cantidad_valores_nulos}')
    print('____________________________________________________________\n')
    
    print('Valores NICOS por columna:\n')
    for columna in df.columns:
        cantidad_valores_unicos = df[columna].unique()
        print(f'La columna {columna}: {len(cantidad_valores_unicos)}')
        print(f'La columna {columna}: {cantidad_valores_unicos}')
        
    print('____________________________________________________________\n')
    
    print('Valores DUPLICADOS por columna es de:\n')
    for columna in df.columns:
        cantidad_duplicados = df[columna].duplicated().sum()
        print(f'La columna {columna}: {cantidad_duplicados}')
    print('____________________________________________________________\n')
  
    print('--> RESUMEN ESTADSTICO \n')
    print('<<< Variables Num茅ricas >>> \n')
    print(df.describe().T)
    print('<<< Variables Categ贸ricas >>> \n')
    print(df.describe(include='object').T)

In [15]:
exploracion_datos1(df_loyal)

 Filas y Columnas del DATAFRAME

El n煤mero de filas que tenemos es de 16737.
El n煤mero de columnas es de 16

____________________________________________________________

 Nombre de todas las Columnas del DATAFRAME:

Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month'],
      dtype='object')
____________________________________________________________

INFORMACIN GENERAL DEL DATAFRAME

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB
None
____________________________________________________________

Ver los NULOS del DataFrame

Nulos de todo el data: --> 209862.5

La columna Loyalty Number: 0.0
La columna Country: 0.0
La columna Province: 0.0
La columna City: 0.0
La columna Postal Code: 0.0
La columna Gender: 0.0
La columna Education: 0.0
La columna Salary: 25.321144769074504
La columna Marital Status: 0.0
La columna Loyalty Card: 0.0
La columna CLV: 0.0
La columna Enrollment Type: 0.0
La columna Enrollment Year: 0.0
La columna Enrollment Month: 0.0
La columna Cancellation Year: 87.65011650833483
La columna Cancellation Month: 87.65011650833483
____________________________________________________________

Valores NICOS por columna:

La columna Loyalty Number: 16737
La columna Loyalty Number: [480934 549612 429460 ... 776187 906428 652627]
La columna Country: 1
La columna Country: ['Canada']
La columna Province: 11
La columna Province: ['Ontario' 'Alberta' 'British Columbia' 'Quebec' 'Yukon' 'New Brunswick'
 'Manitoba' 'Nova Scotia' 'Saskatchewan' 'Newfoundland'
 'Prince Edward Island']
La columna City: 29
La columna City: ['Toronto' 'Edmonton' 'Vancouver' 'Hull' 'Whitehorse' 'Trenton' 'Montreal'
 'Dawson Creek' 'Quebec City' 'Fredericton' 'Ottawa' 'Tremblant' 'Calgary'
 'Thunder Bay' 'Whistler' 'Peace River' 'Winnipeg' 'Sudbury'
 'West Vancouver' 'Halifax' 'London' 'Regina' 'Kelowna' "St. John's"
 'Victoria' 'Kingston' 'Banff' 'Moncton' 'Charlottetown']
La columna Postal Code: 55
La columna Postal Code: ['M2Z 4K1' 'T3G 6Y6' 'V6E 3D9' 'P1W 1K4' 'J8Y 3Z5' 'Y2K 6R0' 'P5S 6R4'
 'K8V 4B2' 'H2Y 2W2' 'M8Y 4K8' 'U5I 4F1' 'G1B 3L5' 'H4G 3T4' 'M2M 7K8'
 'M2M 6J7' 'E3B 2H2' 'M1R 4K3' 'T9G 1W3' 'H2Y 4R4' 'V5R 1W3' 'P1L 8X8'
 'K1F 2R2' 'H5Y 2S9' 'V1E 4R6' 'H2T 2J6' 'T3E 2V9' 'H2T 9K8' 'K8T 5M5'
 'V6T 1Y8' 'P2T 6G3' 'T9O 2W2' 'V6E 3Z3' 'R6Y 4T5' 'M5V 1G5' 'V6V 8Z3'
 'B3J 9S2' 'M5B 3E4' 'R2C 0M5' 'S6J 3G0' 'M2P 4F6' 'P1J 8T7' 'V09 2E9'
 'A1C 6H9' 'V10 6T5' 'B3C 2M8' 'M9K 2P4' 'T4V 1D4' 'R3R 3T4' 'S1J 3C5'
 'E1A 2A7' 'K1G 4Z0' 'H3T 8L4' 'C1A 6E8' 'H3J 5I6' 'M3R 4K8']
La columna Gender: 2
La columna Gender: ['Female' 'Male']
La columna Education: 5
La columna Education: ['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']
La columna Salary: 5891
La columna Salary: [ 83236.     nan 103495. ...  76178.  91970. -57297.]
La columna Marital Status: 3
La columna Marital Status: ['Married' 'Divorced' 'Single']
La columna Loyalty Card: 3
La columna Loyalty Card: ['Star' 'Aurora' 'Nova']
La columna CLV: 7984
La columna CLV: [ 3839.14  3839.61  3839.75 ... 44771.3  50568.26 61134.68]
La columna Enrollment Type: 2
La columna Enrollment Type: ['Standard' '2018 Promotion']
La columna Enrollment Year: 7
La columna Enrollment Year: [2016 2014 2013 2012 2015 2018 2017]
La columna Enrollment Month: 12
La columna Enrollment Month: [ 2  3  7 10  5  6 12  1 11  8  4  9]
La columna Cancellation Year: 7
La columna Cancellation Year: [  nan 2018. 2015. 2017. 2014. 2016. 2013.]
La columna Cancellation Month: 13
La columna Cancellation Month: [nan  1. 12.  4.  2.  7. 11.  5.  6. 10.  8.  9.  3.]
____________________________________________________________

Valores DUPLICADOS por columna es de:

La columna Loyalty Number: 0
La columna Country: 16736
La columna Province: 16726
La columna City: 16708
La columna Postal Code: 16682
La columna Gender: 16735
La columna Education: 16732
La columna Salary: 10846
La columna Marital Status: 16734
La columna Loyalty Card: 16734
La columna CLV: 8753
La columna Enrollment Type: 16735
La columna Enrollment Year: 16730
La columna Enrollment Month: 16725
La columna Cancellation Year: 16730
La columna Cancellation Month: 16724
____________________________________________________________

--> RESUMEN ESTADSTICO

<<< Variables Num茅ricas >>>

                      count           mean            std        min  \
Loyalty Number      16737.0  549735.880445  258912.132453  100018.00
Salary              12499.0   79245.609409   35008.297285  -58486.00
CLV                 16737.0    7988.896536    6860.982280    1898.01
Enrollment Year     16737.0    2015.253211       1.979111    2012.00
Enrollment Month    16737.0       6.669116       3.398958       1.00
Cancellation Year    2067.0    2016.503145       1.380743    2013.00
Cancellation Month   2067.0       6.962748       3.455297       1.00

                          25%        50%        75%        max
Loyalty Number      326603.00  550434.00  772019.00  999986.00
Salary               59246.50   73455.00   88517.50  407228.00
CLV                   3980.84    5780.18    8940.58   83325.38
Enrollment Year       2014.00    2015.00    2017.00    2018.00
Enrollment Month         4.00       7.00      10.00      12.00
Cancellation Year     2016.00    2017.00    2018.00    2018.00
Cancellation Month       4.00       7.00      10.00      12.00
<<< Variables Categ贸ricas >>>

                 count unique       top   freq
Country          16737      1    Canada  16737
Province         16737     11   Ontario   5404
City             16737     29   Toronto   3351
Postal Code      16737     55   V6E 3D9    911
Gender           16737      2    Female   8410
Education        16737      5  Bachelor  10475
Marital Status   16737      3   Married   9735
Loyalty Card     16737      3      Star   7637
Enrollment Type  16737      2  Standard  15766

## --> Union de los dos csv

In [16]:
print(df_fly.columns)
print(df_loyal.columns)

Index(['Loyalty Number', 'Year', 'Month', 'Flights Booked',
       'Flights with Companions', 'Total Flights', 'Distance',
       'Points Accumulated', 'Points Redeemed', 'Dollar Cost Points Redeemed'],
      dtype='object')
Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month'],
      dtype='object')

In [17]:
df_merge_left = df_fly.merge(df_loyal, how = 'left', left_on = 'Loyalty Number', right_on = 'Loyalty Number')
df_merge_left.sample(5)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
189157,482561,2017,10,2,2,4,1672,167.0,386,31,Canada,Alberta,Edmonton,T3G 6Y6,Male,Bachelor,68249.0,Single,Star,8769.27,Standard,2013,7,NaN,NaN
54364,296736,2017,4,0,0,0,0,0.0,0,0,Canada,Quebec,Montreal,H2Y 2W2,Female,College,NaN,Married,Star,4717.63,Standard,2016,5,NaN,NaN
178581,609072,2017,11,10,0,10,2460,246.0,0,0,Canada,Quebec,Montreal,H2T 9K8,Female,Doctor,117643.0,Married,Star,2619.17,Standard,2017,4,NaN,NaN
207877,371159,2018,1,0,0,0,0,0.0,0,0,Canada,Ontario,Trenton,K8V 4B2,Female,College,NaN,Single,Nova,6559.35,Standard,2014,12,NaN,NaN
237935,618523,2018,1,1,0,1,1306,130.0,0,0,Canada,Ontario,Trenton,K8V 4B2,Male,Doctor,87499.0,Married,Aurora,9939.26,Standard,2015,2,2018.0,12.0

In [18]:
print(f"las filas y columnas que tenemos en df_fly: {df_fly.shape}")
print("-------------------------------------------------------------------")

print(f"las filas y columnas que tenemos en df_loyal: {df_loyal.shape}")
print("-------------------------------------------------------------------")

print(f"las filas y columnas que tenemos ahora en la uni贸n de las dos tablas: {df_merge_left.shape}")

las filas y columnas que tenemos en df_fly: (405624, 10)
-------------------------------------------------------------------
las filas y columnas que tenemos en df_loyal: (16737, 16)
-------------------------------------------------------------------
las filas y columnas que tenemos ahora en la uni贸n de las dos tablas: (405624, 25)

In [19]:
# Identificar filas duplicadas exactas (todas las columnas iguales)
exact_duplicates = df_merge_left[df_merge_left.duplicated(keep=False)]

# Filtrar los duplicados que tambi茅n tienen el mismo 'Loyalty Number'
exact_duplicates_sorted = exact_duplicates.sort_values(by=['Loyalty Number', 'Year', 'Month'])

# Mostrar el DataFrame resultante
exact_duplicates_sorted.sample(5)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
57596,467894,2017,4,0,0,0,0,0.0,0,0,Canada,British Columbia,Dawson Creek,U5I 4F1,Female,Doctor,116909.0,Married,Nova,20725.38,Standard,2015,2,NaN,NaN
349188,693926,2018,9,0,0,0,0,0.0,0,0,Canada,Ontario,Toronto,M2Z 4K1,Male,High School or Below,48104.0,Married,Star,2665.22,Standard,2013,3,NaN,NaN
324160,263267,2018,8,0,0,0,0,0.0,0,0,Canada,Quebec,Montreal,H2Y 2W2,Male,College,NaN,Single,Nova,11624.82,Standard,2018,11,NaN,NaN
371082,960050,2018,10,0,0,0,0,0.0,0,0,Canada,Ontario,Thunder Bay,K8T 5M5,Female,Bachelor,103151.0,Single,Aurora,8622.84,Standard,2015,12,NaN,NaN
218972,960050,2018,1,0,0,0,0,0.0,0,0,Canada,Ontario,Thunder Bay,K8T 5M5,Female,Bachelor,103151.0,Single,Aurora,8622.84,Standard,2015,12,NaN,NaN

In [20]:
# Eliminar duplicados en la columna 'employeenumber' y conservar solo la primera ocurrencia
df_merge_left.drop_duplicates(keep='first', inplace=True)

In [21]:
df_merge_left.shape

(403760, 25)

In [22]:
# Guarda el DataFrame como un archivo CSV
df_merge_left.to_csv("DF_sin_duplicados.csv", index = False)